#include <stdio.h>

//Να εισάγονται στο main 3 float τιμές, να μεταβιβάζονται σε μια συνάρτηση που να "επιστρέφει" το ΜΟ και το γινόμενο τους στο main και να τυπώνεται
//Οι 3 τιμές να μεταβιβάζονται σε μια συνάρτηση που να υπολογίζει και να "επιστρέφει" τη max και τη min τιμή

void mo(float a, float b, float c,float *mo,float *gin);
void max_min(float a, float b, float c,float *max,float *min);

int main()
{
    float a,b,c,m,g,max,min;

    printf("Enter 3 values \n");
    scanf("%f%f%f",&a,&b,&c);

    mo(a,b,c,&m,&g);/*μεταβιβάζουμε διευθυνσεις μεταβλητών του main στις οποίες θέλουμε να καταχωρηθούν
    απευθείας αποτελέσματα από τη συνάρτηση*/

    printf("Average = %.2f and Product =%.f\n",m,g);/*μεταβιβάζουμε διευθυνσεις μεταβλητών του main στις οποίες θέλουμε να καταχωρηθούν
    απευθείας αποτελέσματα από τη συνάρτηση*/

    max_min(a,b,c,&max,&min);

    printf("Max = %.2f and Min  =%.2f\n",max,min);

    return 0;
}

void mo(float a, float b, float c,float *mo,float *gin) /*Το *mo είναι δείκτης και λαμβάνει τη διεύθυνση της μεταβλητής m από το main
Το *gin είναι δείκτης και λαμβάνει τη διεύθυνση της μεταβλητής g από το main */
{
    *mo=(a+b+c)/3; /*Στο περιεχόμενο της μεταβλητής που δείχνει ο δείκτης mo δηλ. απευθείας στο m του main καταχωρείται ο ΜΟ*/
    *gin=a*b*c; /*Στο περιεχόμενο της μεταβλητής που δείχνει ο δείκτης gin δηλ. απευθείας στο g του main καταχωρείται το γινόμενο*/
}

void max_min(float a, float b, float c,float *max,float *min)/*Το *max είναι δείκτης και λαμβάνει τη διεύθυνση της μεταβλητής max από το main
Το *min είναι δείκτης και λαμβάνει τη διεύθυνση της μεταβλητής min από το main*/
{
    *max=*min=a; /*Στο περιεχόμενο της μεταβλητής που δείχνει ο δείκτης max δηλ. στο max του main καταχωρείται το a υποθέτοντας ότι η 1η 
    τιμή είναι και η μέγιστη. Στο περιεχόμενο της μεταβλητής που δείχνει ο δείκτης min δηλ. στο min του main καταχωρείται το a υποθέτοντας ότι
    η 1η τιμή είναι ταυτόχρονα και η ελάχιστη*/

    if (b>*max)
        *max=b;

    if (c>*max)
        *max=c;

    if (b<*min)
        *min=b;

    if (c<*min)
        *min=c;
}